## Анализ данных по доходу населения UCI Adult

In [32]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('adult.data.csv')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

##### **1. Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?**

In [9]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

##### **2. Каков средний возраст (признак age) женщин?**

In [14]:
df['sex'] = df['sex'].astype('str')
df[df['sex'] == 'Female']['age'].mean()

36.85823043357163

##### **3. Какова доля граждан Германии (признак native-country)?**

In [17]:
df['native-country'].value_counts(normalize=True)['Germany']

0.004207487485028101

##### **4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?**

In [36]:
print('Среднее значение возраста тех, кто получает более 50К:', df[df['salary'] == '>50K']['age'].mean())
print('СКО возраста тех, кто получает более 50К:', df[df['salary'] == '>50K']['age'].std())
print()
print('Среднее значение возраста тех, кто получает менее 50К:', df[df['salary'] == '<=50K']['age'].mean())
print('СКО возраста тех, кто получает менее 50К:', df[df['salary'] == '<=50K']['age'].std())

df.groupby(['salary'])['age'].agg([np.mean, np.std])

Среднее значение возраста тех, кто получает более 50К: 44.24984058155847
СКО возраста тех, кто получает более 50К: 10.51902771985177

Среднее значение возраста тех, кто получает менее 50К: 36.78373786407767
СКО возраста тех, кто получает менее 50К: 14.020088490824813

             mean        std
salary
<=50K   36.783738  14.020088
>50K    44.249841  10.519028

##### **6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)**

In [45]:
pd.crosstab(df['salary'], df['education'], margins=True)

education,10th,11th,12th,1st-4th,5th-6th,7th-8th,9th,Assoc-acdm,Assoc-voc,Bachelors,Doctorate,HS-grad,Masters,Preschool,Prof-school,Some-college,All
salary,,,,,,,,,,,,,,,,,
<=50K,871,1115,400,162,317,606,487,802,1021,3134,107,8826,764,51,153,5904,24720
>50K,62,60,33,6,16,40,27,265,361,2221,306,1675,959,0,423,1387,7841
All,933,1175,433,168,333,646,514,1067,1382,5355,413,10501,1723,51,576,7291,32561

##### **7. Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.**

In [57]:
df.groupby(['race', 'sex'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [58]:
df.groupby(['race', 'sex'])['age'].describe()['max']

race                sex
Amer-Indian-Eskimo  Female    80.0
                    Male      82.0
Asian-Pac-Islander  Female    75.0
                    Male      90.0
Black               Female    90.0
                    Male      90.0
Other               Female    74.0
                    Male      77.0
White               Female    90.0
                    Male      90.0
Name: max, dtype: float64

##### **8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [64]:
pd.crosstab(df['salary'], df['marital-status'], margins=True, normalize=True)

marital-status,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,All
salary,,,,,,,,
<=50K,0.122232,0.000399,0.254415,0.011793,0.313012,0.029452,0.027886,0.75919
>50K,0.014219,0.000307,0.205522,0.001044,0.015079,0.002027,0.002610,0.24081
All,0.136452,0.000706,0.459937,0.012837,0.328092,0.031479,0.030497,1.00000

##### **9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [65]:
df['hours-per-week'].max()

99

In [83]:
df_max_workhours_per_week = df[df['hours-per-week'] == df['hours-per-week'].max()]
df_max_workhours_per_week.shape

(85, 15)

In [89]:
df_max_workhours_per_week
pd.crosstab(df_max_workhours_per_week['hours-per-week'], df_max_workhours_per_week['salary'], normalize=True)

salary             <=50K      >50K
hours-per-week
99              0.705882  0.294118

##### **10. Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).**

In [96]:
df.groupby(['native-country', 'salary'])['hours-per-week'].mean()['Japan']

salary
<=50K    41.000000
>50K     47.958333
Name: hours-per-week, dtype: float64